cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'coreutils'
brew 'findutils'
brew 'fish'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'git-delta'
brew 'libgit2'
brew 'libusb'
brew 'openssl'
brew 'minicom'
brew 'readline'
brew 'postgresql@14'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'spark'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'vips'

brew 'pyenv'
brew 'qemu'
brew 'openocd'
brew 'zig'

brew 'asdf'

# cask 'firefox'
# cask 'gcc-arm-embedded'
cask 'google-chrome'
# cask 'google-cloud-sdk'
# cask 'handbrake'
cask 'macdown'
# cask 'mactex'
cask 'slack'
cask 'sourcetree'
cask 'transmission'
# cask 'vagrant'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'vlc'

cask 'alfred'
cask 'divvy'
cask 'fantastical'
cask 'postico'
cask 'postgres-unofficial'